//=============================================================================
// Plugin_Name : RX_T_Effect_Uncertain_Skills
// File_Name   : RX_T_Effect_Uncertain_Skills.js
// Version     : 1.01
// Copylight   : 2015 TYPE74RX-T
//=============================================================================


//=============================================================================
/*:
 * @plugindesc 効果が常に不確定なスキルを作れるようになります。
 * @author TYPE74RX-T
 * @help ============================================================================
 * * 効果不確定スキル
 * ============================================================================
 * 効果が常に不確定なスキルを作れるようになります。
 * ============================================================================
 * * 使い方
 * ============================================================================
 * プラグインを導入後、スキルのメモ欄に記入します。
 *
 * 例：スキルID4番、6番、10番のスキルの中からランダムで選ぶようにしたい場合
 * <効果不確定:4, 6, 10>
 *
 * 【仕様】
 * １．基本設定、発動、メッセージ、必要武器の設定は
 * 　　ランダムで選ばれたスキルのものではなく
 * 　　効果不確定スキルに設定したスキルのものになります。
 * ２．逃走、またはこれと同様の効果を持ったスキルを設定した場合
 * 　　正常に動作しない場合があります。
 * ３．戦闘時以外に使うスキルに効果不確定設定をしても効果はありません。
 * ============================================================================
 * * ドキュメント終了 
 * ============================================================================
*/
(function() {
	
	//BattleManager
    var rx_t_bmina151212_apply = BattleManager.invokeNormalAction;
    BattleManager.invokeNormalAction = function(subject, target) {
        if (this._action.item().note.match("<効果不確定:")){
            var rx_stringSkl = this._action.item().note.match(/<効果不確定:([^>]+)/)[1];
            var rx_sskResult = rx_stringSkl.split(",");
            var rx_selectedSkillId = Number(rx_sskResult[Math.randomInt(rx_sskResult.length)]);
            this._action.setSkill(rx_selectedSkillId);
        }
        rx_t_bmina151212_apply.call(this, subject, target);
    };

})();